from flask_wtf import FlaskForm
from wtforms import  StringField, SubmitField, TextAreaField, SelectField, IntegerField, FloatField, SelectMultipleField
from wtforms.validators import DataRequired

class CardFormGeneral(FlaskForm):
    complaints = TextAreaField("Жалобы", validators=[DataRequired()], render_kw={"class": "form-control", "placeholder" : "Жалобы пациента..."})
    anamnesis = TextAreaField("Анамнез", validators=[DataRequired()], render_kw={"class": "form-control", "placeholder" : "Анамнез..."})
    condition = SelectField("Общее состояние", choices=[("Удовлетворительное", "Удовлетворительное"), ("Средней степени тяжести", "Средней степени тяжести"), ("Тяжелое", "Тяжелое"), ("Терминальное", "Терминальное")], default=("Удовлетворительное", "Удовлетворительное"))
    conscience = SelectField("Сознание", choices=[("Ясное", "Ясное"), ("Оглушение", "Оглушение"), ("Сопор", "Сопор"), ("Кома", "Кома")])
    glazgo_scale = IntegerField("Шкала Глазго",default=15)
    body_position = SelectField("Положение тела", choices=[("Активное", "Активное"), ("Пассивное", "Пассивное"), ("Вынужденное", "Вынужденное")], default=("Активное", "Активное"))
    t_body = FloatField("Температура тела", default=36.6)
    breath_frequence = IntegerField("ЧДД")
    oxygen_saturation = IntegerField("SpO2")
    heart_rate = IntegerField("ЧСС")
    pulse = IntegerField("Пульс")
    sugar = FloatField("Сахар крови")
    submit = SubmitField("Готово!", render_kw={"class": "btn btn-primary"})

class SkinForm(FlaskForm):
  skin_dryness = SelectField("Кожные покровы", choices=[("Сухие", "Сухие"), ("Влажные", "Влажные")], default=("Сухие", "Сухие"))
  skin_colour = SelectField("Цвет", choices=[("Обычной окраски", "Обычные"), ("Бледные", "Бледные"), ("Гиперемированные", "Гиперемированные"), ("Цианоз", "Цианоз")], default=("Обычной окраски", "Обычные"))
  skin_yellowness = StringField("Желтушность", default="Нет")
  skin_rash = SelectField("Сыпь", choices=[("Нет", "Нет"), ("Петехиальная", "Петехиальная"), ("Пустулёзная", "Пустулёзная"), ("Везикулярная", "Везикулярная"), ("Узелковая", "Узелковая"), ("Другое", "Другое")], default=("Нет", "Нет"))
  skin_throat = SelectField("Зев", choices=[("Спокоен", "Спокоен"), ("Гиперемирован", "Гиперемирован")], default=("Спокоен", "Спокоен"))
  skin_tonsils = StringField("Миндилины", default="Не увеличинены")
  skin_tonsils = StringField("Миндилины", default="Не увеличинены")
  skin_lymph_nodes = StringField("Лимфоузлы", default="Не увеличинены")
  skin_edema = SelectMultipleField("Отеки", choices=[("Нет", "Нет"), ("Голени", "Голени"), ("Лицо", "Лицо"), ("Туловище", "Туловище"), ("Руки", "Руки")], default=("Нет", "Нет"))
  
class BreathingSysthem(FlaskForm):
  breathin_type = SelectField("Тип дыхания", choices=[("Везикулярное", "Везикулярное"), ("Жёсткое", "Жёсткое"), ("Бронхиальное", "Бронхиальное"), ("Пуэриальное", "Пуэрильное"), ("Ослабленное", "Ослабленное"), ("Отсутствует", "Отсутствует")], default=("Везикулярное", "Везикулярное"))
  breath_wheezing = SelectField("Хрипы", choices=[("Нет", "Нет"), ("Влажные", "Влажные"), ("Сухие", "Сухие")], default=("Нет", "Нет"))
  breath_wheezing_localization = StringField("Локализация хрипов", default="Нет хрипов")
  breath_dyspnea = SelectField("Одышка", choices=[("Нет", "Нет"), ("Инспираторная", "Инспираторная"), ("Экспираторная", "Экспираторная"), ("Смешанная", "Смешанная")], default=("Нет", "Нет"))
  
class HeartForm(FlaskForm):
  heart_sounds = SelectField("Тоны сердца", choices=[("Ритмичные", "Ритмичные"), ("Аритмичные", "Аритмичные")], default=("Ритмичные", "Ритмичные"))
  heart_sounds_type = SelectField("Тоны сердца", choices=[("Ясные", "Ясные"), ("Глухие", "Глухие"), ("Приглушены", "Приглушены"), ("Отсутствуют", "Отсутствуют")], default=("Ясные", "Ясные"))
  heart_murmur = SelectMultipleField("Шум", choices=[("Нет", "Нет"), ("Систолический", "Систолический"),("Диастолический", "Диастолический"), ("Трения перикарда", "Трения перикарда"), ("Другое", "Другое")], default=("Нет", "Нет"))
  heart_beat = SelectMultipleField("Пульс", choices=[("Ритмичный", "Ритмичный"), ("Аритмичный", "Аритмичный"), ("Слабого наполнения", "Слабого наполнения"), ("Напряжённый", "Напряжённый"), ("Нитевидный", "Нитевидный"), ("Отсутсвует", "Отсутствует")], default=[("Ритмичный", "Ритмичный"), ("Нормальный", "Нормальный")])
  heart_pulse_deficit = SelectField("Дефицит пульса", choices=[("Нет", "Нет"), ("Да", "Да")], default=("Нет", "Нет"))
  heart_accent_tone = StringField("Акцент тона", default=("Нет", "Нет"))

class DysgestionSystem(FlaskForm):
  abdominal_condition = SelectMultipleField("Живот", choices=[("Мягкий", "Мягкий"), ("Безболезненный", "Безболезненный"), ("Напряжён", "Напряжён"), ("Участвует в акте дыхания", "Участвует в акте дыхания"), ("Вздут", "Вздут"), ("Болезненный", "Болезненный")], default=[("Мягкий", "Мягкий"), ("Безболезненный", "Безболезненный")])
  peritoneal_irritation_symptoms = SelectMultipleField("Симптомы раздражения брюшины", choices=[("Отрицательны", "Отрицательны"), ("Щёткина-Блюмберга", "Щёткина-Блюмберга"), ("Воскресенского", "Воскресенского"), ("Ортнера", "Ортнера"), ("Ровзинга", "Ровзинга"), ("Пастернацкого", "Пастернацкого"), ("Ситковского", "Ситковского"), ("Образцова", "Образцова"), ("Мерфи", "Мерфи"), ("Другое", "Другое")], default=[("Отрицательны", "Отрицательны")])
  liver = StringField("Печень", default=("Не увеличена"))
  stool_type = SelectField("Стул", choices=[("Оформлен", "Оформлен"), ("Разжижен", "Разжижен"), ("Жидкий", "Жидкий"), ("Отсутсвует", "Отсутствует")], default=[("Оформлен", "Оформлен")])
  stool_frequence_general = SelectField("Реглярность", choices=[("Регулярный", "Регулярный"), ("Нерегулярный", "Нерегулярный"), ("отсутствует", "Отсутствует")], default=("Регулярный", "Регулярный"))
  stool_frequence_specific = IntegerField("Частота стула")

class UrogentitalSystem(FlaskForm):
  urination =  SelectMultipleField("Мочеиспускание", choices=[("Безболезненное", "Безболезненное"), ("Свободное", "Свободное"), ("Болезненное", "Болезненное"), ("Затруднено", "Затруднено"), ("Отсутствует", "Отсутствует")], default=[("Безболезненное", "Безболезненное"), ("Свободное", "Свободное")])
  pounding_symptom = SelectField("Симптом поколачивания", choices=[("Отрицательный с обеих сторон", "Отрицательный с обеих сторон"), ("Положительный слева", "Положительный слева"), ("Положительный справа", "Положительный справа"), ("Положительный с обеих сторон", "Положительный с обеих сторон"), ("Слабоположительный слева", "Слабоположительный слева"), ("Слабоположительный справа", "Слабоположительный справа"), ("Слабоположительный с обеих сторон", "Слабоположительный с обеих сторон")], default=("Отрицательный с обеих сторон", "Отрицательный с обеих сторон"))
  urine = SelectMultipleField("Моча", choices=[("Светло-жёлтая", "Светло-жёлтая"), ("Мутная", "Мутная"), ("С включениями", "С включениями"), ("С осадком", "С осадком")])